#### [`repos-official-new`] Terraform Plan 📖`success`

<a href="https://app.terraform.io/app/cdktf-team/prebuilt-providers-official-new/runs/run-YjdtUFkub7gwCaXr" target="_blank">Remote Plan Link ↗️</a>

<details><summary>Show Plan</summary>

```tf
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cdktf-team/prebuilt-providers-official-new/runs/run-YjdtUFkub7gwCaXr

Waiting for the plan to start...

Terraform v1.13.5
on linux_amd64
Initializing plugins and modules...
data.github_team.cdktf-team-cdktf: Reading...
github_repository.cdktf-provider-boundary-go_repo_75E89202: Refreshing state... [id=cdktf-provider-boundary-go]
github_repository.cdktf-provider-boundary_repo_42C67723: Refreshing state... [id=cdktf-provider-boundary]
github_repository.cdktf-provider-http-go_repo_95F76B07: Refreshing state... [id=cdktf-provider-http-go]
github_repository.cdktf-provider-vsphere_repo_D89D8AEF: Refreshing state... [id=cdktf-provider-vsphere]
github_repository.cdktf-provider-http_repo_A5B505E7: Refreshing state... [id=cdktf-provider-http]
github_repository.cdktf-provider-nomad-go_repo_B7F9DDF8: Refreshing state... [id=cdktf-provider-nomad-go]
github_repository.cdktf-provider-nomad_repo_D9601687: Refreshing state... [id=cdktf-provider-nomad]
github_repository.cdktf-provider-vsphere-go_repo_FA3E7FDD: Refreshing state... [id=cdktf-provider-vsphere-go]
github_actions_secret.cdktf-provider-boundary_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_7AC80464: Refreshing state... [id=cdktf-provider-boundary:PROJEN_GITHUB_TOKEN]
github_actions_secret.cdktf-provider-boundary_repo_secret-npm-token_4E8D698B: Refreshing state... [id=cdktf-provider-boundary:NPM_TOKEN]
github_actions_secret.cdktf-provider-boundary_repo_secret-maven-password_AEF5308C: Refreshing state... [id=cdktf-provider-boundary:MAVEN_PASSWORD]
github_actions_secret.cdktf-provider-boundary_repo_secret-alert-prs-slack-webhook-url_07110875: Refreshing state... [id=cdktf-provider-boundary:ALERT_PRS_SLACK_WEBHOOK_URL]
github_actions_secret.cdktf-provider-boundary_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_86296BA7: Refreshing state... [id=cdktf-provider-boundary:GO_GITHUB_TOKEN]
github_issue_label.cdktf-provider-boundary_repository-setup_no-auto-close-label_FE55C611: Refreshing state... [id=cdktf-provider-boundary:no-auto-close]
github_actions_secret.cdktf-provider-boundary_repo_secret-maven-gpg-private-key-passphrase_95613E0D: Refreshing state... [id=cdktf-provider-boundary:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_repository_dependabot_security_updates.cdktf-provider-boundary_dependabot-security_F1850417: Refreshing state... [id=cdktf-provider-boundary]
github_actions_secret.cdktf-provider-boundary_repo_secret-maven-username_F0193805: Refreshing state... [id=cdktf-provider-boundary:MAVEN_USERNAME]
github_actions_secret.cdktf-provider-boundary_repo_secret-nuget-api-key_F62D37DC: Refreshing state... [id=cdktf-provider-boundary:NUGET_API_KEY]
github_actions_secret.cdktf-provider-boundary_repo_secret-maven-gpg-private-key_16D71AB9: Refreshing state... [id=cdktf-provider-boundary:MAVEN_GPG_PRIVATE_KEY]
github_issue_label.cdktf-provider-boundary_repository-setup_auto-approve-label_5F0F3238: Refreshing state... [id=cdktf-provider-boundary:auto-approve]
github_repository_webhook.cdktf-provider-boundary_repository-setup_slack-webhook_0401AB4E: Refreshing state... [id=387361932]
github_actions_secret.cdktf-provider-boundary_repo_secret-twine-username_4CEE6A24: Refreshing state... [id=cdktf-provider-boundary:TWINE_USERNAME]
github_actions_secret.cdktf-provider-boundary_repo_secret-twine-password_A811FEB3: Refreshing state... [id=cdktf-provider-boundary:TWINE_PASSWORD]
github_actions_secret.cdktf-provider-boundary_repo_secret-gh-token_6ADC2DE5: Refreshing state... [id=cdktf-provider-boundary:GH_TOKEN]
github_branch_protection.cdktf-provider-boundary_repository-setup_main-protection_1B77FF13: Refreshing state... [id=BPR_kwDOIIy5Y84B07sy]
data.github_team.cdktf-team-cdktf: Read complete after 5s [id=6602018]
github_actions_secret.cdktf-provider-boundary_repo_secret-maven-staging-profile-id_36C2977B: Refreshing state... [id=cdktf-provider-boundary:MAVEN_STAGING_PROFILE_ID]
github_issue_label.cdktf-provider-boundary_repository-setup_automerge-label_1959FD9E: Refreshing state... [id=cdktf-provider-boundary:automerge]
github_issue_label.cdktf-provider-boundary-go_repository-setup_auto-approve-label_9BDEBB6A: Refreshing state... [id=cdktf-provider-boundary-go:auto-approve]
github_repository_webhook.cdktf-provider-boundary-go_repository-setup_slack-webhook_22CB3B37: Refreshing state... [id=387361767]
github_issue_label.cdktf-provider-boundary-go_repository-setup_no-auto-close-label_94FD8D77: Refreshing state... [id=cdktf-provider-boundary-go:no-auto-close]
github_issue_label.cdktf-provider-boundary-go_repository-setup_automerge-label_3FFC739B: Refreshing state... [id=cdktf-provider-boundary-go:automerge]
github_repository_dependabot_security_updates.cdktf-provider-vsphere_dependabot-security_C73BF565: Refreshing state... [id=cdktf-provider-vsphere]
github_actions_secret.cdktf-provider-vsphere_repo_secret-maven-username_C6C21111: Refreshing state... [id=cdktf-provider-vsphere:MAVEN_USERNAME]
github_actions_secret.cdktf-provider-vsphere_repo_secret-nuget-api-key_F451A69E: Refreshing state... [id=cdktf-provider-vsphere:NUGET_API_KEY]
github_actions_secret.cdktf-provider-vsphere_repo_secret-maven-gpg-private-key_9A98A642: Refreshing state... [id=cdktf-provider-vsphere:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.cdktf-provider-vsphere_repo_secret-alert-prs-slack-webhook-url_6881023D: Refreshing state... [id=cdktf-provider-vsphere:ALERT_PRS_SLACK_WEBHOOK_URL]
github_issue_label.cdktf-provider-vsphere_repository-setup_auto-approve-label_26689A29: Refreshing state... [id=cdktf-provider-vsphere:auto-approve]
github_actions_secret.cdktf-provider-vsphere_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_C4C0CC0F: Refreshing state... [id=cdktf-provider-vsphere:GO_GITHUB_TOKEN]
github_issue_label.cdktf-provider-vsphere_repository-setup_automerge-label_D953924C: Refreshing state... [id=cdktf-provider-vsphere:automerge]
github_issue_label.cdktf-provider-vsphere_repository-setup_no-auto-close-label_B47BD98F: Refreshing state... [id=cdktf-provider-vsphere:no-auto-close]
github_actions_secret.cdktf-provider-vsphere_repo_secret-gh-token_131FD6FA: Refreshing state... [id=cdktf-provider-vsphere:GH_TOKEN]
github_actions_secret.cdktf-provider-vsphere_repo_secret-maven-gpg-private-key-passphrase_2CE0EB17: Refreshing state... [id=cdktf-provider-vsphere:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.cdktf-provider-vsphere_repo_secret-npm-token_9BE8DAAC: Refreshing state... [id=cdktf-provider-vsphere:NPM_TOKEN]
github_actions_secret.cdktf-provider-vsphere_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_B0134BB1: Refreshing state... [id=cdktf-provider-vsphere:PROJEN_GITHUB_TOKEN]
github_actions_secret.cdktf-provider-vsphere_repo_secret-maven-password_0A766AB6: Refreshing state... [id=cdktf-provider-vsphere:MAVEN_PASSWORD]
github_repository_webhook.cdktf-provider-vsphere_repository-setup_slack-webhook_1C70AAF7: Refreshing state... [id=387361761]
github_branch_protection.cdktf-provider-vsphere_repository-setup_main-protection_CDD08549: Refreshing state... [id=BPR_kwDOIIyyHM4B07rh]
github_actions_secret.cdktf-provider-vsphere_repo_secret-twine-username_3F52A761: Refreshing state... [id=cdktf-provider-vsphere:TWINE_USERNAME]
github_actions_secret.cdktf-provider-vsphere_repo_secret-twine-password_036AE96E: Refreshing state... [id=cdktf-provider-vsphere:TWINE_PASSWORD]
github_actions_secret.cdktf-provider-vsphere_repo_secret-maven-staging-profile-id_4BFCB4B3: Refreshing state... [id=cdktf-provider-vsphere:MAVEN_STAGING_PROFILE_ID]
github_repository_dependabot_security_updates.cdktf-provider-http_dependabot-security_05C26C55: Refreshing state... [id=cdktf-provider-http]
github_actions_secret.cdktf-provider-http_repo_secret-maven-gpg-private-key_2E35F915: Refreshing state... [id=cdktf-provider-http:MAVEN_GPG_PRIVATE_KEY]
github_repository_webhook.cdktf-provider-http_repository-setup_slack-webhook_5C0A6FF4: Refreshing state... [id=387361657]
github_actions_secret.cdktf-provider-http_repo_secret-maven-gpg-private-key-passphrase_752286DF: Refreshing state... [id=cdktf-provider-http:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_issue_label.cdktf-provider-http_repository-setup_auto-approve-label_EF772BB5: Refreshing state... [id=cdktf-provider-http:auto-approve]
github_branch_protection.cdktf-provider-http_repository-setup_main-protection_3E4C6B8F: Refreshing state... [id=BPR_kwDOIIyyU84B07q8]
github_actions_secret.cdktf-provider-http_repo_secret-maven-staging-profile-id_17DF2C16: Refreshing state... [id=cdktf-provider-http:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.cdktf-provider-http_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_5ECB4895: Refreshing state... [id=cdktf-provider-http:PROJEN_GITHUB_TOKEN]
github_actions_secret.cdktf-provider-http_repo_secret-twine-username_5A7A81AC: Refreshing state... [id=cdktf-provider-http:TWINE_USERNAME]
github_actions_secret.cdktf-provider-http_repo_secret-maven-password_CEFF4E3F: Refreshing state... [id=cdktf-provider-http:MAVEN_PASSWORD]
github_issue_label.cdktf-provider-http_repository-setup_no-auto-close-label_A7654DEF: Refreshing state... [id=cdktf-provider-http:no-auto-close]
github_actions_secret.cdktf-provider-http_repo_secret-npm-token_61575784: Refreshing state... [id=cdktf-provider-http:NPM_TOKEN]
github_actions_secret.cdktf-provider-http_repo_secret-maven-username_C22F3D5C: Refreshing state... [id=cdktf-provider-http:MAVEN_USERNAME]
github_actions_secret.cdktf-provider-http_repo_secret-nuget-api-key_F1E662AF: Refreshing state... [id=cdktf-provider-http:NUGET_API_KEY]
github_actions_secret.cdktf-provider-http_repo_secret-twine-password_6B51E0D0: Refreshing state... [id=cdktf-provider-http:TWINE_PASSWORD]
github_actions_secret.cdktf-provider-http_repo_secret-alert-prs-slack-webhook-url_36A7DF5D: Refreshing state... [id=cdktf-provider-http:ALERT_PRS_SLACK_WEBHOOK_URL]
github_issue_label.cdktf-provider-http_repository-setup_automerge-label_43F35C14: Refreshing state... [id=cdktf-provider-http:automerge]
github_actions_secret.cdktf-provider-http_repo_secret-gh-token_6A0C957E: Refreshing state... [id=cdktf-provider-http:GH_TOKEN]
github_actions_secret.cdktf-provider-http_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_3F92695D: Refreshing state... [id=cdktf-provider-http:GO_GITHUB_TOKEN]
github_issue_label.cdktf-provider-nomad-go_repository-setup_automerge-label_4ABD51BB: Refreshing state... [id=cdktf-provider-nomad-go:automerge]
github_repository_webhook.cdktf-provider-nomad-go_repository-setup_slack-webhook_6E6ABC9E: Refreshing state... [id=387361749]
github_issue_label.cdktf-provider-nomad-go_repository-setup_no-auto-close-label_2E51E8F3: Refreshing state... [id=cdktf-provider-nomad-go:no-auto-close]
github_issue_label.cdktf-provider-nomad-go_repository-setup_auto-approve-label_03662F49: Refreshing state... [id=cdktf-provider-nomad-go:auto-approve]
github_repository_webhook.cdktf-provider-http-go_repository-setup_slack-webhook_FC6CE2FA: Refreshing state... [id=387361879]
github_issue_label.cdktf-provider-http-go_repository-setup_no-auto-close-label_C736DA05: Refreshing state... [id=cdktf-provider-http-go:no-auto-close]
github_issue_label.cdktf-provider-http-go_repository-setup_automerge-label_73B6D9E9: Refreshing state... [id=cdktf-provider-http-go:automerge]
github_issue_label.cdktf-provider-http-go_repository-setup_auto-approve-label_14191CC9: Refreshing state... [id=cdktf-provider-http-go:auto-approve]
github_issue_label.cdktf-provider-vsphere-go_repository-setup_no-auto-close-label_CE86ADE5: Refreshing state... [id=cdktf-provider-vsphere-go:no-auto-close]
github_issue_label.cdktf-provider-vsphere-go_repository-setup_auto-approve-label_88D1659F: Refreshing state... [id=cdktf-provider-vsphere-go:auto-approve]
github_repository_webhook.cdktf-provider-vsphere-go_repository-setup_slack-webhook_BD37A45D: Refreshing state... [id=387361714]
github_issue_label.cdktf-provider-vsphere-go_repository-setup_automerge-label_0F7FF690: Refreshing state... [id=cdktf-provider-vsphere-go:automerge]
github_actions_secret.cdktf-provider-nomad_repo_secret-twine-username_70C2E60A: Refreshing state... [id=cdktf-provider-nomad:TWINE_USERNAME]
github_actions_secret.cdktf-provider-nomad_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_CD1BD6D5: Refreshing state... [id=cdktf-provider-nomad:GO_GITHUB_TOKEN]
github_repository_webhook.cdktf-provider-nomad_repository-setup_slack-webhook_28E78340: Refreshing state... [id=387361820]
github_actions_secret.cdktf-provider-nomad_repo_secret-alert-prs-slack-webhook-url_C608766F: Refreshing state... [id=cdktf-provider-nomad:ALERT_PRS_SLACK_WEBHOOK_URL]
github_actions_secret.cdktf-provider-nomad_repo_secret-nuget-api-key_2112FF26: Refreshing state... [id=cdktf-provider-nomad:NUGET_API_KEY]
github_issue_label.cdktf-provider-nomad_repository-setup_no-auto-close-label_C240C613: Refreshing state... [id=cdktf-provider-nomad:no-auto-close]
github_issue_label.cdktf-provider-nomad_repository-setup_auto-approve-label_DD92A4A1: Refreshing state... [id=cdktf-provider-nomad:auto-approve]
github_actions_secret.cdktf-provider-nomad_repo_secret-maven-staging-profile-id_3509C0CF: Refreshing state... [id=cdktf-provider-nomad:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.cdktf-provider-nomad_repo_secret-maven-gpg-private-key_579FD942: Refreshing state... [id=cdktf-provider-nomad:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.cdktf-provider-nomad_repo_secret-maven-username_F2AA1254: Refreshing state... [id=cdktf-provider-nomad:MAVEN_USERNAME]
github_branch_protection.cdktf-provider-nomad_repository-setup_main-protection_97DF745D: Refreshing state... [id=BPR_kwDOIIy2os4B07sB]
github_actions_secret.cdktf-provider-nomad_repo_secret-maven-password_CF630EBE: Refreshing state... [id=cdktf-provider-nomad:MAVEN_PASSWORD]
github_actions_secret.cdktf-provider-nomad_repo_secret-npm-token_33FE3E49: Refreshing state... [id=cdktf-provider-nomad:NPM_TOKEN]
github_actions_secret.cdktf-provider-nomad_repo_secret-gh-token_7B497091: Refreshing state... [id=cdktf-provider-nomad:GH_TOKEN]
github_actions_secret.cdktf-provider-nomad_repo_secret-maven-gpg-private-key-passphrase_92765C79: Refreshing state... [id=cdktf-provider-nomad:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_repository_dependabot_security_updates.cdktf-provider-nomad_dependabot-security_9D878FF5: Refreshing state... [id=cdktf-provider-nomad]
github_actions_secret.cdktf-provider-nomad_repo_secret-twine-password_6E18466C: Refreshing state... [id=cdktf-provider-nomad:TWINE_PASSWORD]
github_actions_secret.cdktf-provider-nomad_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_85BBE7DB: Refreshing state... [id=cdktf-provider-nomad:PROJEN_GITHUB_TOKEN]
github_issue_label.cdktf-provider-nomad_repository-setup_automerge-label_1AAF1662: Refreshing state... [id=cdktf-provider-nomad:automerge]
github_team_repository.cdktf-provider-vsphere-go_repository-setup_managing-team_A3CD15AC: Refreshing state... [id=6602018:cdktf-provider-vsphere-go]
github_team_repository.cdktf-provider-boundary_repository-setup_managing-team_BEA23B63: Refreshing state... [id=6602018:cdktf-provider-boundary]
github_team_repository.cdktf-provider-http-go_repository-setup_managing-team_95F7AEB4: Refreshing state... [id=6602018:cdktf-provider-http-go]
github_team_repository.cdktf-provider-nomad-go_repository-setup_managing-team_20C89E46: Refreshing state... [id=6602018:cdktf-provider-nomad-go]
github_team_repository.cdktf-provider-vsphere_repository-setup_managing-team_1B7AD732: Refreshing state... [id=6602018:cdktf-provider-vsphere]
github_team_repository.cdktf-provider-boundary-go_repository-setup_managing-team_558BC970: Refreshing state... [id=6602018:cdktf-provider-boundary-go]
github_team_repository.cdktf-provider-nomad_repository-setup_managing-team_482B78AE: Refreshing state... [id=6602018:cdktf-provider-nomad]
github_team_repository.cdktf-provider-http_repository-setup_managing-team_7133207A: Refreshing state... [id=6602018:cdktf-provider-http]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_secret.cdktf-provider-dns_repo_secret-alert-prs-slack-webhook-url_18C6A4F8 will be created
  + resource "github_actions_secret" "cdktf-provider-dns_repo_secret-alert-prs-slack-webhook-url_18C6A4F8" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-dns_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_13EB1DB5 will be created
  + resource "github_actions_secret" "cdktf-provider-dns_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_13EB1DB5" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-dns_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_6A5FC7D9 will be created
  + resource "github_actions_secret" "cdktf-provider-dns_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_6A5FC7D9" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-dns_repo_secret-gh-token_4ECE74D2 will be created
  + resource "github_actions_secret" "cdktf-provider-dns_repo_secret-gh-token_4ECE74D2" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-dns_repo_secret-maven-gpg-private-key-passphrase_E904EE8A will be created
  + resource "github_actions_secret" "cdktf-provider-dns_repo_secret-maven-gpg-private-key-passphrase_E904EE8A" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-dns_repo_secret-maven-gpg-private-key_557230F0 will be created
  + resource "github_actions_secret" "cdktf-provider-dns_repo_secret-maven-gpg-private-key_557230F0" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-dns_repo_secret-maven-password_31CC1FEC will be created
  + resource "github_actions_secret" "cdktf-provider-dns_repo_secret-maven-password_31CC1FEC" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-dns_repo_secret-maven-staging-profile-id_5AA32737 will be created
  + resource "github_actions_secret" "cdktf-provider-dns_repo_secret-maven-staging-profile-id_5AA32737" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-dns_repo_secret-maven-username_C7D1EECD will be created
  + resource "github_actions_secret" "cdktf-provider-dns_repo_secret-maven-username_C7D1EECD" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-dns_repo_secret-npm-token_3E6DF1BE will be created
  + resource "github_actions_secret" "cdktf-provider-dns_repo_secret-npm-token_3E6DF1BE" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-dns_repo_secret-nuget-api-key_09403616 will be created
  + resource "github_actions_secret" "cdktf-provider-dns_repo_secret-nuget-api-key_09403616" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-dns_repo_secret-twine-password_0BACA30E will be created
  + resource "github_actions_secret" "cdktf-provider-dns_repo_secret-twine-password_0BACA30E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-dns_repo_secret-twine-username_E43DF3B2 will be created
  + resource "github_actions_secret" "cdktf-provider-dns_repo_secret-twine-username_E43DF3B2" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dns"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_branch_protection.cdktf-provider-dns_repository-setup_main-protection_D94F9829 will be created
  + resource "github_branch_protection" "cdktf-provider-dns_repository-setup_main-protection_D94F9829" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "cdktf-provider-dns"
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = true

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "Validate PR title",
              + "build",
              + "package-dotnet",
              + "package-go",
              + "package-java",
              + "package-js",
              + "package-python",
            ]
          + strict   = false
        }
    }

  # github_issue_label.cdktf-provider-dns-go_repository-setup_auto-approve-label_575F9EF8 will be created
  + resource "github_issue_label" "cdktf-provider-dns-go_repository-setup_auto-approve-label_575F9EF8" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-dns-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-dns-go_repository-setup_automerge-label_D0850113 will be created
  + resource "github_issue_label" "cdktf-provider-dns-go_repository-setup_automerge-label_D0850113" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-dns-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-dns-go_repository-setup_no-auto-close-label_52EF76C3 will be created
  + resource "github_issue_label" "cdktf-provider-dns-go_repository-setup_no-auto-close-label_52EF76C3" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-dns-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-dns_repository-setup_auto-approve-label_2FA38B7C will be created
  + resource "github_issue_label" "cdktf-provider-dns_repository-setup_auto-approve-label_2FA38B7C" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-dns"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-dns_repository-setup_automerge-label_DAD08209 will be created
  + resource "github_issue_label" "cdktf-provider-dns_repository-setup_automerge-label_DAD08209" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-dns"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-dns_repository-setup_no-auto-close-label_D5CA4ACF will be created
  + resource "github_issue_label" "cdktf-provider-dns_repository-setup_no-auto-close-label_D5CA4ACF" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-dns"
      + url        = (known after apply)
    }

  # github_repository.cdktf-provider-dns-go_repo_C7771FC1 will be created
  + resource "github_repository" "cdktf-provider-dns-go_repo_C7771FC1" {
      + allow_auto_merge            = true
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "CDK for Terraform Go provider bindings for dns."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = false
      + has_projects                = false
      + has_wiki                    = false
      + homepage_url                = "https://cdk.tf"
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "cdktf-provider-dns-go"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "PR_BODY"
      + squash_merge_commit_title   = "PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "cdk",
          + "cdktf",
          + "dns",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = false
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # github_repository.cdktf-provider-dns_repo_7569ACCF will be created
  + resource "github_repository" "cdktf-provider-dns_repo_7569ACCF" {
      + allow_auto_merge            = true
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Prebuilt Terraform CDK (cdktf) provider for dns."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + homepage_url                = "https://cdk.tf"
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "cdktf-provider-dns"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "PR_BODY"
      + squash_merge_commit_title   = "PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "cdk",
          + "cdktf",
          + "dns",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # github_repository_dependabot_security_updates.cdktf-provider-dns_dependabot-security_6D5FF91D will be created
  + resource "github_repository_dependabot_security_updates" "cdktf-provider-dns_dependabot-security_6D5FF91D" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "cdktf-provider-dns"
    }

  # github_repository_webhook.cdktf-provider-dns-go_repository-setup_slack-webhook_5B5A2D41 will be created
  + resource "github_repository_webhook" "cdktf-provider-dns-go_repository-setup_slack-webhook_5B5A2D41" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktf-provider-dns-go"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

  # github_repository_webhook.cdktf-provider-dns_repository-setup_slack-webhook_EA6F708A will be created
  + resource "github_repository_webhook" "cdktf-provider-dns_repository-setup_slack-webhook_EA6F708A" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktf-provider-dns"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

  # github_team_repository.cdktf-provider-dns-go_repository-setup_managing-team_72DF965A will be created
  + resource "github_team_repository" "cdktf-provider-dns-go_repository-setup_managing-team_72DF965A" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktf-provider-dns-go"
      + team_id    = "6602018"
    }

  # github_team_repository.cdktf-provider-dns_repository-setup_managing-team_B80C9BCC will be created
  + resource "github_team_repository" "cdktf-provider-dns_repository-setup_managing-team_B80C9BCC" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktf-provider-dns"
      + team_id    = "6602018"
    }

Plan: 27 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ providerRepos = [
        "github_repository.cdktf-provider-boundary_repo_42C67723.ssh_clone_url",
      + "github_repository.cdktf-provider-dns_repo_7569ACCF.ssh_clone_url",
        "github_repository.cdktf-provider-http_repo_A5B505E7.ssh_clone_url",
        # (2 unchanged elements hidden)
    ]

```

</details>

*Pusher: @team-tf-cdk, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*